ErpTest/src/DataProcessors/пкИзменениеНормРасходаГСМ/пкИзменениеНормРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пкИзменениеНормРасходаГСМ</name>
  <comment>Рарус</comment>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СезонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ErpTest/src/InformationRegisters/уатНормыРасходаГСМ/уатНормыРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНормыРасходаГСМ</name>
  <comment>(уат)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЛинейнаяНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЕздку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЗапуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаИзменениеСобственногоВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОперацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОтопитель</name>
    <comment>Норма на отопитель</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаПростойСВклДвигателем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота1</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота2</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота3</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота4</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота5</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота6</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота7</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота8</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота9</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота10</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу7</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу8</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу9</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаТранспортнуюРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаСпециальнаяНаМоточас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СезоннаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиДляРасчетаНормыМоточасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ГСМ</name>
    <comment>ГСМ</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельТС</name>
    <comment>Модель ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.уатМоделиТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/уатМестонахождениеТС/уатМестонахождениеТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатМестонахождениеТС</name>
  <comment>(уат)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Колонна</name>
    <type>
      <types>CatalogRef.уатКолонны</types>
    </type>
  </resources>
  <dimensions>
    <name>ТС</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/DataProcessors/пкИзменениеНормРасходаГСМ/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Период") Тогда
		Объект.Период = Параметры.Период;
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") Тогда
		Объект.Подразделение = Параметры.Подразделение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОповеститьОВыборе("ВыполненаОбработка");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура УстановитьНормы(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		Отказ = Истина;
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Не указан период!'");
		тСообщение.Сообщить();
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНормыНаСервере()
	
 	тПериод	= НачалоДня(КонецМесяца(Объект.Период));
	тГСМ	= "";
	тТС		= "";

	ЗапросН = Новый Запрос;
	ЗапросН.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатНормыРасходаГСМСрезПоследних.ГСМ,
	|	уатНормыРасходаГСМСрезПоследних.МодельТС,
	|	уатНормыРасходаГСМСрезПоследних.Организация,
	|	уатНормыРасходаГСМСрезПоследних.ЛинейнаяНорма,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаЕздку,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаЗапуск,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаИзменениеСобственногоВеса,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаОперацию,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаОтопитель,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаПростойСВклДвигателем,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаПростойСВклДвигателемПроцентомОтБазовой,
	|	уатНормыРасходаГСМСрезПоследних.НормаНаТранспортнуюРаботу,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаКилометр,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаКилометр2,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаКилометр3,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаКилометр4,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаКилометр5,
	|	уатНормыРасходаГСМСрезПоследних.НормаСпециальнаяНаМоточас,
	|	уатНормыРасходаГСМСрезПоследних.СезоннаяНадбавка,
	|	уатНормыРасходаГСМСрезПоследних.УчитыватьПростоиДляРасчетаНормыМоточасов
	|ИЗ
	|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних(&Период, ) КАК уатНормыРасходаГСМСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Период, ) КАК уатМестонахождениеТССрезПоследних
	|		ПО уатНормыРасходаГСМСрезПоследних.МодельТС = уатМестонахождениеТССрезПоследних.ТС" + ?(НЕ ЗначениеЗаполнено(Объект.Подразделение), "", "
	|ГДЕ
	|	уатМестонахождениеТССрезПоследних.Подразделение = &Подразделение");
	ЗапросН.УстановитьПараметр("Период", КонецМесяца(Объект.Период));
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ЗапросН.УстановитьПараметр("Подразделение", Объект.Подразделение);
	КонецЕсли;
	РезЗапроса = ЗапросН.Выполнить().Выбрать();
	Пока РезЗапроса.Следующий() Цикл
		
		тГСМ	= РезЗапроса.ГСМ;
		тТС		= РезЗапроса.МодельТС;
		
		тОбъект = РегистрыСведений.уатНормыРасходаГСМ.СоздатьНаборЗаписей();
		тОбъект.Отбор.Период.Установить(тПериод, Истина);
		тОбъект.Отбор.ГСМ.Установить(тГСМ, Истина);
		тОбъект.Отбор.МодельТС.Установить(тТС, Истина);
		тОбъект.Прочитать();
			
		Если тОбъект.Количество() = 0 Тогда
			НоваяСтрока = тОбъект.Добавить();
			НоваяСтрока.Период		= тПериод;
			НоваяСтрока.ГСМ			= тГСМ;
			НоваяСтрока.МодельТС	= тТС;
		Иначе
			НоваяСтрока = тОбъект[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РезЗапроса);
		НоваяСтрока.СезоннаяНадбавка	= Объект.СезонныйКоэффициент;
		
		тОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			тОбъект.Записать(Истина);
		Исключение
			тСообщение = Новый СообщениеПользователю;
			тСообщение.Текст = ОписаниеОшибки();
			тСообщение.Сообщить();
			Прервать;
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры
